# My First pandas Data Frame

We're going to create a simple data frame by hand here. We start by importing the key library pandas:

In [1]:
import pandas as pd

Then, let's create a couple Series objects and add them into a new DataFrame object:

In [2]:
sn = pd.Series([1, 2, 3, 4])
sc = pd.Series(['a', 'b', 'c', 'd'])

df = pd.DataFrame({'a': sc, 
                   'b': sn})
df

   a  b
0  a  1
1  b  2
2  c  3
3  d  4

Once the data frame has been created, we can add new columns by name:

In [3]:
df['c'] = pd.Series(['One', 'Two', 'Three', 'Four'])
df

   a  b      c
0  a  1    One
1  b  2    Two
2  c  3  Three
3  d  4   Four

Deleting a column from a data frame is a little different, we can't just set it to None (similar to what we would do in R). Let's see what happens if we try that:

In [4]:
df['c'] = None
df

   a  b     c
0  a  1  None
1  b  2  None
2  c  3  None
3  d  4  None

That didn't work! Let's restore the column to what it was previously:

In [5]:
df['c'] = pd.Series(['One', 'Two', 'Three', 'Four'])
df

   a  b      c
0  a  1    One
1  b  2    Two
2  c  3  Three
3  d  4   Four

To delete a column from a DataFrame, we need to use the drop() function to remove the column and assign the result back to a new object:

In [6]:
dropped = df.drop(columns=['c'])
dropped

   a  b
0  a  1
1  b  2
2  c  3
3  d  4

Notice that the original data frame is unchanged:

In [7]:
df

   a  b      c
0  a  1    One
1  b  2    Two
2  c  3  Three
3  d  4   Four

If we wanted to delete the column 'in-place' (i.e., without having to copy the object), the drop function provides an 'inplace' argument:

In [8]:
dropped.drop(columns=['a'], inplace=True)
dropped

   b
0  1
1  2
2  3
3  4

## Navigating a DataFrame

Lookup in a pandas DataFrame is similar to simple array indexing. Here's some examples:

In [9]:
df.iat[1, 0] ## literally the value at table cell (row=1, col=0)

'b'

In [10]:
df['c'][:3] ## first three values of the 'c' column

0      One
1      Two
2    Three
Name: c, dtype: object

In [11]:
df[:2] ## first two rows

   a  b    c
0  a  1  One
1  b  2  Two

In [12]:
df[df['a']=='c']

   a  b      c
2  c  3  Three